Docs/Reference/Content/images/dependencies/net9.0/alloverit-logging.d2
direction: left

aoi: AllOverIt
aoi.alloverit-logging: AllOverIt.Logging
microsoft-extensions-logging-abstractions_8-0-1: Microsoft.Extensions.Logging.Abstractions\nv8.0.1
microsoft-extensions-logging-abstractions_8-0-1.style.fill: "#ADD8E6"
microsoft-extensions-logging-abstractions_8-0-1.style.opacity: 0.8
microsoft-extensions-dependencyinjection-abstractions_8-0-1: Microsoft.Extensions.DependencyInjection.Abstractions\nv8.0.1
microsoft-extensions-dependencyinjection-abstractions_8-0-1.style.fill: "#FFEC96"
microsoft-extensions-dependencyinjection-abstractions_8-0-1.style.opacity: 0.8
microsoft-extensions-dependencyinjection-abstractions_8-0-1 <- microsoft-extensions-logging-abstractions_8-0-1
microsoft-extensions-logging-abstractions_8-0-1 <- aoi.alloverit-logging
aoi.alloverit: AllOverIt
aoi.alloverit-assertion: AllOverIt.Assertion
aoi.alloverit-assertion <- aoi.alloverit
aoi.alloverit <- aoi.alloverit-logging
